<div class='container-con-block darkmode-block'>
	<div class='container-con-wrapper'>
		<div class="anchor-point" id="supported_devices_handhelds">
		</div>
		<div class='container-tx1-block darkmode-txt'>
			<div class='container-emp-block'>
			</div>
			<h2>Для чего нужно IT?</h2>
		</div>
		<div class='container-tx2-block darkmode-txt'>
			<p class="download-desc">
				Информационные технологии (от англ. information technology, IT) являются широким классом дисциплин и направлений деятельности, связанных с технологиями создания, хранения, управлением и обработкой данных, включая применение вычислительных технологий. Информационные технологии в последнее время чаще понимаются под компьютерными технологиями. ИТ, в частности, занимается созданием, хранением, обработкой, ограничениями передачи и получения информации. Специалистов компьютерной техники и программирования нередко называют IT-специалистами.В широком смысле IT охватывает всю область создания, хранения, восприятия информации, а также не только технологии компьютера. В то же время ИТ нередко ассоциируется с компьютерной технологией, а это неслучайно: появление компьютеров привело ИТ к новым уровням. Как когда-то телевидение и еще раньше печатное дело.Информационные технологии занимаются созданием, разработкой и управлением информационными системами. ИТ предназначены для решения задач, связанных с эффективной организацией информационных процессов на основе современных достижений в области компьютерных технологий и других высокотехнологичных процессов, новых средств связи, программных средств и опыта практического применения.ИТ также помогает найти решения задач, связанных с эффективной организацией информационных процессов с целью снижения расходов на время, труд, энергию и материальные ресурсы во всех областях жизни. Информационные технологии взаимодействуют и чаще всего являются составляющими частями сфер услуг, управления, производственного, социального процессов.Основная задача информационной технологии заключается в том, чтобы в результате целевых действий по обработке первичной информации передать необходимую информацию пользователю.Информационная система – это среда, составляющие элементы которой – компьютеры, сети компьютеров, программное обеспечение, базы данных, человек, различные технические и программные средства связи, и так далее.Основная задача информационной системы заключается в организации хранения, передачи данных. Информационная система – это человеко-компьютерная система обработки информации.
			</p>
		</div>
	</div>
</div>